app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("category", "content", "title", "author_id", "image", "date", "reference", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)