app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("name", "job", "bio", "contact", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Maria"], ["job", "Nurse"], ["bio", "xo xo gossip girl"], ["contact", "marialinda@gmail.com"], ["created_at", "2018-08-18 18:33:01.581980"], ["updated_at", "2018-08-18 18:33:01.581980"]]